Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_cmd.c
/**********************************************************************************************************************
* Copyright (c) 2014 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
**********************************************************************************************************************/
/**********************************************************************************************************************
* System Name  : SDHI Driver
* File Name    : r_sdc_sd_cmd.c
* Version      : 3.01
* Device       : RX
* Abstract     : API & Sub module
* Tool-Chain   : For RX e2_studio
* OS           : not use
* H/W Platform : RSK board for RX
* Description  : Interface file for SDC SD API for RX
* Limitation   : None
**********************************************************************************************************************/
/**********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 05.09.2014 1.00    First Release
*              : 17.07.2015 1.10    Standardized by the combo.
*              : 31.07.2017 2.00    SDHI FIT module separated into hardware low level layer and middleware layer.
*              :                    Changed prefix from SDHI to SDC_SD.
*              : 29.06.2018 2.02    Corresponded to SD Specifications Part1 Physical Layer Simplified Specification.
*              : 10.02.2020 3.00    Added comment "WAIT_LOOP".
*              : 20.03.2025 3.01    Changed the disclaimer in program sources.
**********************************************************************************************************************/

/**********************************************************************************************************************
Includes <System Includes> , "Project Includes"
**********************************************************************************************************************/
#include "r_sdc_sd_rx_if.h"
#include ".\src\r_sdc_sd_rx_private.h"

/**********************************************************************************************************************
Macro definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Typedef definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Private global variables and functions
**********************************************************************************************************************/
/* ==== response errors ==== */
static const sdc_sd_status_t g_sdc_sd_resp_err_tbl[] =
{
    SDC_SD_ERR_OUT_OF_RANGE,
    SDC_SD_ERR_ADDRESS_ERROR,
    SDC_SD_ERR_BLOCK_LEN_ERROR,
    SDC_SD_ERR_CARD_ERASE,
    SDC_SD_ERR_CARD_ERASE,
    SDC_SD_ERR_WP,
    SDC_SD_ERR_CARD_LOCK,
    SDC_SD_ERR_CARD_UNLOCK,
    SDC_SD_ERR_CARD_CRC,
    SDC_SD_ERR_ILLEGAL_COMMAND,
    SDC_SD_ERR_CARD_ECC,
    SDC_SD_ERR_CARD_CC,
    SDC_SD_ERR_CARD_ERROR,
    SDC_SD_ERR_RESERVED_ERROR18,
    SDC_SD_ERR_RESERVED_ERROR17,
    SDC_SD_ERR_OVERWRITE
};

/* ==== IO errors ==== */
static const sdc_sd_status_t g_sdc_sd_io_err_tbl[] =
{
    SDC_SD_ERR_CARD_CRC,
    SDC_SD_ERR_ILLEGAL_COMMAND,
    SDC_SD_ERR_INTERNAL,
    SDC_SD_ERR_INTERNAL,
    SDC_SD_ERR_CARD_ERROR,
    SDC_SD_ERR_INTERNAL,
    SDC_SD_ERR_ILL_FUNC,
    SDC_SD_ERR_OUT_OF_RANGE,
    SDC_SD_ERR_INTERNAL,
    SDC_SD_ERR_INTERNAL,
    SDC_SD_ERR_INTERNAL,
    SDC_SD_ERR_INTERNAL,
    SDC_SD_ERR_INTERNAL,
    SDC_SD_ERR_INTERNAL,
    SDC_SD_ERR_INTERNAL,
    SDC_SD_ERR_INTERNAL
};

/* ==== SDHI_SDSTS2 errors table ==== */
static const sdc_sd_status_t g_sdc_sd_info2_err_tbl[] =
{
    SDC_SD_ERR_RES_TOE,     /* SDHI_SDIMSK2_ERR6   0x0040 */
    SDC_SD_ERR_ILL_READ,    /* SDHI_SDIMSK2_ERR5   0x0020 */
    SDC_SD_ERR_ILL_WRITE,   /* SDHI_SDIMSK2_ERR4   0x0010 */
    SDC_SD_ERR_CARD_TOE,    /* SDHI_SDIMSK2_ERR3   0x0008 */
    SDC_SD_ERR_END_BIT,     /* SDHI_SDIMSK2_ERR2   0x0004 */
    SDC_SD_ERR_CRC,         /* SDHI_SDIMSK2_ERR1   0x0002 */
    SDC_SD_ERR_CMD_ERROR    /* SDHI_SDIMSK2_ERR0   0x0001 */
};

/* ==== transfer speed table ==== */
static const uint32_t g_sdc_sd_tran_speed[8] =
{
    1,      /* 100kbit/s */
    10,     /* 1Mbit/s */
    100,    /* 10Mbit/s */
    1000,   /* 100Mbit/s */
    1000,   /* reserved */
    1000,   /* reserved */
    1000,   /* reserved */
    1000    /* reserved */
};

static const uint8_t g_sdc_sd_time_value[16] =
{
     0, 10, 12, 13, 15,
    20, 25, 30, 35, 40,
    45, 50, 55, 60, 70,
    80
};

static void r_sdc_sd_get_sdsts2(uint32_t card_no);

/**********************************************************************************************************************
* Outline      : Issue SD Command
* Function Name: r_sdc_sd_send_cmd
* Description  : Issues a SD command, and then waits for the receive response.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           cmd                 ;   Command code
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : other                                  ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_send_cmd(uint32_t card_no, uint32_t cmd)
{
    sdc_sd_hndl_t * p_hndl = 0;
    volatile int32_t  i = 0;
    int32_t           time = 0;
    uint32_t          reg = 0;

    switch (cmd)
    {
        case SDC_SD_CMD38:     /* Erase command */
            time = SDC_SD_TIMEOUT_ERASE_CMD;
        break;

        case SDC_SD_CMD7:
        case SDC_SD_CMD12:
            /* CMD7, CMD12 are contained. */
            time = SDC_SD_TIMEOUT_RESP; /* Treat same as write operation timeout. */
        break;

        default:
            time = SDC_SD_TIMEOUT_CMD;
        break;
    }

    p_hndl = SDC_SD_GET_HNDL(card_no);
    
    p_hndl->error = SDC_SD_SUCCESS;

    /* Enable the resp end. */
    r_sdc_sd_disable_icu_int(card_no);
    r_sdc_sd_set_int_mask(card_no, SDHI_SDIMSK1_RESP, 0);
    r_sdc_sd_enable_icu_int(card_no);

    /* WAIT_LOOP */
    for (i = 0 ; i < SDC_SD_SCLKDIVEN_LOOP_COUNT ; i++)
    {
#ifdef USE_INFO2_CBSY
        R_SDHI_InReg(p_hndl->channel, SDHI_SDSTS2, &reg);
        if (0 == reg & SDHI_SDIMSK2_CBSY)
        {
            break;
        }
#else
        R_SDHI_InReg(p_hndl->channel, SDHI_SDSTS2, &reg);
        if (reg & SDHI_SDIMSK2_SCLKDIVEN)
        {
            break;
        }
#endif
    }

