Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_cmd.c
    if (SDC_SD_SCLKDIVEN_LOOP_COUNT == i)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_CBSY_ERROR);       /* treat as CBSY ERROR */
        r_sdc_sd_disable_icu_int(card_no);
        r_sdc_sd_clear_int_mask(card_no, SDHI_SDIMSK1_RESP, 0);
        r_sdc_sd_enable_icu_int(card_no);
        return p_hndl->error;
    }

    /* ---- Clear previous errors. ---- */
    r_sdc_sd_disable_icu_int(card_no);
    r_sdc_sd_clear_sdsts(card_no, SDHI_SDIMSK1_TRNS_RESP, SDHI_SDIMSK2_CLEAR);
    r_sdc_sd_enable_icu_int(card_no);

    /* ---- Issue a command. ---- */
    R_SDHI_OutReg(p_hndl->channel, SDHI_SDCMD, cmd);

    /* ---- Wait for the resp end. ---- */
    if (r_sdc_sd_int_wait(card_no, time) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_HOST_TOE);
        r_sdc_sd_disable_icu_int(card_no);
        r_sdc_sd_clear_int_mask(card_no, SDHI_SDIMSK1_RESP, SDHI_SDIMSK2_ILA);
        R_SDHI_ClearSdstsReg(p_hndl->channel, SDHI_SDIMSK1_RESP, SDHI_SDIMSK2_ERR);
        r_sdc_sd_clear_sdsts(card_no, SDHI_SDIMSK1_RESP, SDHI_SDIMSK2_ERR);
        r_sdc_sd_enable_icu_int(card_no);
        return p_hndl->error;
    }

    /* Disable the resp end and the illegal access interrupts. */
    r_sdc_sd_disable_icu_int(card_no);
    r_sdc_sd_clear_int_mask(card_no, SDHI_SDIMSK1_RESP, SDHI_SDIMSK2_ILA);
    r_sdc_sd_enable_icu_int(card_no);

    r_sdc_sd_get_sdsts2(card_no);    /* Get the SDHI_SDSTS2 register. */

    r_sdc_sd_check_sdsts2_err(card_no);  /* Check the SDHI_SDSTS2 error bits. */

    if (0 == (p_hndl->sdsts1 & SDHI_SDIMSK1_RESP))
    {
        /* Set the error code in case of no error code. */
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_NO_RESP_ERROR);        /* No response */
    }

    /* ---- Clear previous errors. ---- */
    /* SDHI_SDSTS1 and SDHI_SDSTS2 are already cleared in interrupt handler.*/
/*  R_SDHI_ClearSdstsReg(p_hndl->channel, SDHI_SDIMSK1_RESP, SDHI_SDIMSK2_ERR); */
    r_sdc_sd_disable_icu_int(card_no);
    r_sdc_sd_clear_sdsts(card_no, SDHI_SDIMSK1_RESP, SDHI_SDIMSK2_ERR);
    r_sdc_sd_enable_icu_int(card_no);

    return p_hndl->error;
} /* End of function r_sdc_sd_send_cmd() */

/**********************************************************************************************************************
* Outline      : Issue Application Specific Command
* Function Name: r_sdc_sd_send_acmd
* Description  : Issues a application specific command, and then waits for the receive response.
*              : Issues a CMD55 preceding the application specific command.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           cmd                 ;   Command code
*              : uint32_t           arg                 ;   Command argument [31:0]
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_send_acmd(uint32_t card_no, uint32_t cmd, uint32_t arg)
{
    sdc_sd_hndl_t * p_hndl = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* ---- Issue a CMD55. ---- */
    if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD55, SDC_SD_RESP_R1, p_hndl->rca[0]) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
        return SDC_SD_ERR;
    }

    /* ---- Issue an ACMD. ---- */
    if (r_sdc_sd_send_cmd_arg(card_no, cmd, SDC_SD_RESP_NON, arg) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
        return SDC_SD_ERR;
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_send_acmd() */

/**********************************************************************************************************************
* Outline      : Issue General SD Command
* Function Name: r_sdc_sd_send_cmd_arg
* Description  : Issues a command, and then waits for the receive response.
*              : After finishing this function, start the data transfer.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : uint32_t           cmd                 ;   Command code
*              : uint32_t           arg                 ;   Command argument [31:0]
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : other                                  ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_send_cmd_arg(uint32_t card_no, uint32_t cmd, int32_t resp, uint32_t arg)
{
    sdc_sd_hndl_t * p_hndl = 0;
    sdc_sd_status_t ret = SDC_SD_SUCCESS;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    R_SDHI_OutReg(p_hndl->channel, SDHI_SDARG, arg);

    /* ---- Issue a command. ---- */
    ret = r_sdc_sd_send_cmd(card_no, cmd);
    if (SDC_SD_SUCCESS == ret)
    {
        ret = r_sdc_sd_get_resp(card_no, resp); /* Get and check the response. */
    }
    else
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
    }

    return ret;
} /* End of function r_sdc_sd_send_cmd_arg() */

/**********************************************************************************************************************
* Outline      : Get OCR Register
* Function Name: r_sdc_sd_send_ocr
* Description  : Gets a OCR register and checks card operation voltage.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : int32_t            type                ;   Card type
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : other                                  ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_send_ocr(uint32_t card_no, int32_t type)
{
    sdc_sd_hndl_t * p_hndl = 0;
    int32_t           i = 0;
    sdc_sd_status_t ret = SDC_SD_SUCCESS;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* ===== Distinguish card type using the CMD5, ACMD41. ==== */
    /* WAIT_LOOP */
    for (i = 0; i < 200; i++)
    {
        switch (type)
        {
            case SDC_SD_MEDIA_UNKNOWN:  /* Unknown media */
                /* ---- Issue CMD5 without argument. ---- */
                ret = r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD5, SDC_SD_RESP_R4, 0);
                return ret;
            break;

            case SDC_SD_MEDIA_SDIO:
                /* ---- Issue the CMD5. ---- */
                ret = r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD5, SDC_SD_RESP_NON, p_hndl->voltage);
            break;

            case SDC_SD_MEDIA_SDMEM:
            case SDC_SD_MEDIA_COMBO:
                /* SDC_SD_MEDIA_SDMEM and SDC_SD_MEDIA_COMBO are contained. */
                /* Set a HCS bit according the CMD8 response. */
                if (SDC_SD_SPEC_10 != p_hndl->sd_spec)
                {
                    /* Set the voltage pattern to a HCS bit. */
                    p_hndl->voltage = (p_hndl->voltage | SDC_SD_OCR_HCS);
                }
                /* ---- Issue the ACMD41. ---- */
                ret = r_sdc_sd_send_acmd(card_no, SDC_SD_ACMD41, p_hndl->voltage);
            break;

            default:
                p_hndl->resp_status = 0;
                /* Set the error code. */
                p_hndl->error = SDC_SD_ERR_INTERNAL;
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
                return SDC_SD_ERR;
            break;
        }

        if (SDC_SD_SUCCESS == ret)
        {
            if (SDC_SD_MEDIA_SDIO == type)    /* IO */
            {
#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO)
                r_sdc_sd_get_resp(card_no, SDC_SD_RESP_R4); /* Check the R4 response. */
                /* ---- Poll the busy bit. ---- */
                if (p_hndl->io_ocr[0] & SDC_SDIO_CMD5_R4_C)   /* Busy cleared */
                {
                    break;
                }
                else
                {
                    ret = SDC_SD_ERR;   /* Busy */
                    r_sdc_sd_wait(card_no, 5);  /* Issue the wait function due to retry. */
                }
#endif /* SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_IO */
            }
            else    /* Memory */
            {
                r_sdc_sd_get_resp(card_no, SDC_SD_RESP_R3); /* Check the R3 response. */
                /* ---- Poll the busy bit. ---- */
                if (p_hndl->ocr[0] & SDC_SD_OCR_BUSY)  /* Busy cleared */
                {
                    break;
                }
                else
                {
                    ret = SDC_SD_ERR;   /* Busy */
                    r_sdc_sd_wait(card_no, 5);  /* Issue the wait function due to retry. */
                }
            }
        }
    }

    return ret;
} /* End of function r_sdc_sd_send_ocr() */

/**********************************************************************************************************************
* Outline      : Check R1 Response Errors
* Function Name: r_sdc_sd_check_resp_error
* Description  : Distinguishes the error from the R1 response and then sets p_hndl->error to the error.
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   No error detected
*              : SDC_SD_ERR                             ;   Errors detected
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_check_resp_error(uint32_t card_no)
{
    sdc_sd_hndl_t * p_hndl = 0;
    uint32_t          status = 0;
    int32_t           bit = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    status = (uint32_t)((p_hndl->resp_status & SDC_SD_RES_ERR_UPPER) >> SDC_SD_BIT_SHIFT_16);
    
