Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/r_sdc_sd_cmd.c
        case SDC_SD_RESP_R5:        /* IO RW response */
            R_SDHI_GetResp(p_hndl->channel, &resp_reg);
            status[0] = resp_reg.sdrsp10;
            p_hndl->resp_status = status[0];

            if (status[0] & SDC_SD_R5_CARD_STATUS_ERR)
            {
                /* Any status error */
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
                return r_sdc_sd_check_resp5_error(card_no);
            }
        break;

        case SDC_SD_RESP_R7:       /* IF_COND response */
            R_SDHI_GetResp(p_hndl->channel, &resp_reg);
            p_hndl->if_cond[0] = resp_reg.sdrsp10;
        break;

        default:
            /* Unknown type */
            p_hndl->resp_status = 0;
            /* Set the error code. */
            p_hndl->error = SDC_SD_ERR_INTERNAL;
            return SDC_SD_ERR;
        break;
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_get_resp() */

/**********************************************************************************************************************
* Outline      : Check CSD Register
* Function Name: r_sdc_sd_check_csd
* Description  : Checks the CSD register and then gets the information.
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : SDC_SD_ERR                             ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_check_csd(uint32_t card_no)
{
    sdc_sd_hndl_t * p_hndl = 0;
    uint32_t          transpeed = 0;
    uint32_t          timevalue = 0;
    uint32_t          erase_sector_size = 0;
    uint32_t          erase_group_size = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* ---- CSD Structure ---- */
    p_hndl->csd_structure = (uint8_t)((p_hndl->csd[0] & SDC_SD_CSD_STRUCTURE) >> SDC_SD_BIT_SHIFT_30);

    /* Use sd_spec to check cmd8 response status */
    if (1 <= p_hndl->csd_structure)
    {
        if(SDC_SD_SPEC_20 > p_hndl->sd_spec)
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
            r_sdc_sd_set_err(card_no, SDC_SD_ERR_CSD_VER);
            return SDC_SD_ERR;
        }
    }

    /* ---- TAAC/NSAC ---- */
    /* No check, set the fixed data. */

    /* ---- TRAN_SPEED  ---- */
    transpeed = (p_hndl->csd[0] & SDC_SD_CSD_TRAN_SPEED);
    timevalue = (p_hndl->csd[0] & SDC_SD_CSD_TIME_VALUE) >> SDC_SD_BIT_SHIFT_3;

    transpeed = (uint32_t)(g_sdc_sd_tran_speed[transpeed] * g_sdc_sd_time_value[timevalue]);

    /* ---- Set transfer speed for memory access. ---- */
    if (SDC_SD_CSD_TRAN_SPEED_2500 <= transpeed)
    {
        p_hndl->csd_tran_speed = SDC_SD_CLK_25MHz;
    }
    else if (SDC_SD_CSD_TRAN_SPEED_2000 <= transpeed)
    {
        p_hndl->csd_tran_speed = SDC_SD_CLK_20MHz;
    }
    else if (SDC_SD_CSD_TRAN_SPEED_1000 <= transpeed)
    {
        p_hndl->csd_tran_speed = SDC_SD_CLK_10MHz;
    }
    else if (SDC_SD_CSD_TRAN_SPEED_500 <= transpeed)
    {
        p_hndl->csd_tran_speed = SDC_SD_CLK_5MHz;
    }
    else if (SDC_SD_CSD_TRAN_SPEED_100 <= transpeed)
    {
        p_hndl->csd_tran_speed = SDC_SD_CLK_1MHz;
    }
    else
    {
        p_hndl->csd_tran_speed = SDC_SD_CLK_400kHz;
    }

    /* ---- CCC  ---- */
    p_hndl->csd_ccc = (uint32_t)(((p_hndl->csd[1] & SDC_SD_CSD_CCC) >> SDC_SD_BIT_SHIFT_20));

    /* ---- PERM/TMP_WRITE_PROTECT ---- */
    p_hndl->write_protect = (p_hndl->write_protect | (uint8_t)((p_hndl->csd[3] & SDC_SD_CSD_PROTECT) >> SDC_SD_BIT_SHIFT_11));

    /* ---- Calculate the number of erase sectors ---- */
    erase_sector_size = ((p_hndl->csd[2] & SDC_SD_CSD_ERASE_SEC_SIZE) >> SDC_SD_BIT_SHIFT_7);
    erase_group_size = (p_hndl->csd[2] & SDC_SD_CSD_ERASE_GRP_SIZE);
    p_hndl->erase_sect = (erase_sector_size + 1) * (erase_group_size + 1);

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_check_csd() */

/**********************************************************************************************************************
* Outline      : Check SDHI_SDSTS2 Register Errors
* Function Name: r_sdc_sd_check_sdsts2_err
* Description  : Checks error bits of the SDHI_SDSTS2 register.
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sd_check_sdsts2_err(uint32_t card_no)
{
    sdc_sd_hndl_t * p_hndl = 0;
    uint32_t          sdsts2 = 0;
    int32_t           bit = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    sdsts2 = (uint32_t)(p_hndl->sdsts2 & SDHI_SDIMSK2_ERR);

    /* ---- Search error bits. ---- */
    bit = r_sdc_sd_bit_search(sdsts2);

    if (SDC_SD_ERR == bit)  /* No error */
    {
        r_sdc_sd_set_err(card_no, SDC_SD_SUCCESS);
    }
    else if (0 == bit)  /* CMD error */
    {
        /* Set the error code. */
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_CMD_ERROR);
    }
    else    /* Other error */
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SD_CMD, __LINE__);
        r_sdc_sd_set_err(card_no, g_sdc_sd_info2_err_tbl[bit - 9]);
    }

    return SDC_SD_SUCCESS;
} /* End of function r_sdc_sd_check_sdsts2_err() */

/**********************************************************************************************************************
* Outline      : Get SDHI_SDSTS2 Register
* Function Name: r_sdc_sd_get_sdsts2
* Description  : Gets the SDHI_SDSTS2 register, stores to p_hndl->sdsts2 and clears the SDHI_SDSTS error flags.
* Arguments    : uint32_t           card_no             ;   SD Card No.
* Return Value : none
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
static void r_sdc_sd_get_sdsts2(uint32_t card_no)
{
    sdc_sd_hndl_t * p_hndl = 0;
    uint32_t        sdsts2_reg = 0;

    p_hndl = SDC_SD_GET_HNDL(card_no);

    R_SDHI_InReg(p_hndl->channel, SDHI_SDSTS2, &sdsts2_reg);
    sdsts2_reg = (uint32_t)((sdsts2_reg & SDHI_SDIMSK2_ERR) & (~SDHI_SDIMSK2_BIT11));
    R_SDHI_OutReg(p_hndl->channel, SDHI_SDSTS2, (uint32_t)~sdsts2_reg);

    p_hndl->sdsts2 = (uint32_t)(p_hndl->sdsts2 | sdsts2_reg);

    return;
} /* End of function r_sdc_sd_get_sdsts2() */

/* End of File */
